Revit 2027 API
BalusterPattern.ExcessLengthFillBalusterId Property
 The id of a Baluster family used to fill excess length, which is the extra space along the railing segment that cannot be filled with a pattern. If set to InvalidElementId, it will be the default - the id of the BaseRailingAttr containing the Baluster pattern.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ExcessLengthFillBalusterId { get; set; }
Public Property ExcessLengthFillBalusterId As ElementId
	Get
	Set
public:
property ElementId^ ExcessLengthFillBalusterId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ExcessLengthFillBalusterId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: Invalid ElementId for leftoverFill of BalusterPattern
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace